In [3]:
import pandas as pd
import numpy as np

## Series

In [6]:
pd.Series(np.arange(10))

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
dtype: int64

In [7]:
# 通过字典创建
color_count = pd.Series({"red": 100, "bule": 200, "green": 500})

In [8]:
color_count

bule     200
green    500
red      100
dtype: int64

In [9]:
# Series属性
## index
color_count.index

Index(['bule', 'green', 'red'], dtype='object')

In [10]:
## values
color_count.values

array([200, 500, 100])

In [11]:
## 使用索引来获取数据
color_count[2]

100

## DataFrame

In [13]:
import pandas as pd
import numpy as np

In [15]:
pd.DataFrame(np.random.randn(2, 3))

          0         1         2
0  0.020819  0.030513  1.020335
1  2.374334 -0.361824 -0.366408

In [17]:
score = np.random.randint(40, 100, (10, 5))
score

array([[56, 98, 96, 83, 59],
       [65, 51, 47, 99, 86],
       [72, 84, 74, 63, 58],
       [52, 71, 98, 99, 58],
       [70, 74, 63, 93, 46],
       [77, 70, 46, 94, 74],
       [46, 98, 77, 84, 40],
       [93, 83, 72, 94, 68],
       [42, 82, 94, 83, 86],
       [43, 47, 42, 62, 79]])

In [20]:
score_df = pd.DataFrame(score)
score_df

    0   1   2   3   4
0  56  98  96  83  59
1  65  51  47  99  86
2  72  84  74  63  58
3  52  71  98  99  58
4  70  74  63  93  46
5  77  70  46  94  74
6  46  98  77  84  40
7  93  83  72  94  68
8  42  82  94  83  86
9  43  47  42  62  79

In [24]:
# 增加行列索引
subjects = ["语文", "数学", "英语", "政治", "体育"]

In [25]:
stu = ["同学" + str(i) for i in range(score_df.shape[0])]

In [26]:
data = pd.DataFrame(score, columns=subjects, index=stu)

In [27]:
data

     语文  数学  英语  政治  体育
同学0  56  98  96  83  59
同学1  65  51  47  99  86
同学2  72  84  74  63  58
同学3  52  71  98  99  58
同学4  70  74  63  93  46
同学5  77  70  46  94  74
同学6  46  98  77  84  40
同学7  93  83  72  94  68
同学8  42  82  94  83  86
同学9  43  47  42  62  79

In [28]:
data.index

Index(['同学0', '同学1', '同学2', '同学3', '同学4', '同学5', '同学6', '同学7', '同学8', '同学9'], dtype='object')

In [30]:
data.columns

Index(['语文', '数学', '英语', '政治', '体育'], dtype='object')

In [31]:
data.values

array([[56, 98, 96, 83, 59],
       [65, 51, 47, 99, 86],
       [72, 84, 74, 63, 58],
       [52, 71, 98, 99, 58],
       [70, 74, 63, 93, 46],
       [77, 70, 46, 94, 74],
       [46, 98, 77, 84, 40],
       [93, 83, 72, 94, 68],
       [42, 82, 94, 83, 86],
       [43, 47, 42, 62, 79]])

In [32]:
# 转置
data.T

    同学0  同学1  同学2  同学3  同学4  同学5  同学6  同学7  同学8  同学9
语文   56   65   72   52   70   77   46   93   42   43
数学   98   51   84   71   74   70   98   83   82   47
英语   96   47   74   98   63   46   77   72   94   42
政治   83   99   63   99   93   94   84   94   83   62
体育   59   86   58   58   46   74   40   68   86   79

In [33]:
data.head() # 默认前五行数据

     语文  数学  英语  政治  体育
同学0  56  98  96  83  59
同学1  65  51  47  99  86
同学2  72  84  74  63  58
同学3  52  71  98  99  58
同学4  70  74  63  93  46

In [34]:
data.tail() # 默认最后五行数据

     语文  数学  英语  政治  体育
同学5  77  70  46  94  74
同学6  46  98  77  84  40
同学7  93  83  72  94  68
同学8  42  82  94  83  86
同学9  43  47  42  62  79

In [35]:
# 修改行列索引值
stu = ["学生_" + str(i) for i in range(score_df.shape[0])]
data.index = stu

In [36]:
data

      语文  数学  英语  政治  体育
学生_0  56  98  96  83  59
学生_1  65  51  47  99  86
学生_2  72  84  74  63  58
学生_3  52  71  98  99  58
学生_4  70  74  63  93  46
学生_5  77  70  46  94  74
学生_6  46  98  77  84  40
学生_7  93  83  72  94  68
学生_8  42  82  94  83  86
学生_9  43  47  42  62  79

In [38]:
data.reset_index() # 重设索引， 默认不删除原来的索引， drop=False

  index  语文  数学  英语  政治  体育
0  学生_0  56  98  96  83  59
1  学生_1  65  51  47  99  86
2  学生_2  72  84  74  63  58
3  学生_3  52  71  98  99  58
4  学生_4  70  74  63  93  46
5  学生_5  77  70  46  94  74
6  学生_6  46  98  77  84  40
7  学生_7  93  83  72  94  68
8  学生_8  42  82  94  83  86
9  学生_9  43  47  42  62  79

In [39]:
# 以某列值设置为新的索引

In [40]:
df = pd.DataFrame({"month": [1, 4, 7, 10], 
                   "year": [2012, 2014, 2013, 2014],
                   "sale": [55, 40, 84, 31]})
df

   month  sale  year
0      1    55  2012
1      4    40  2014
2      7    84  2013
3     10    31  2014

In [41]:
df.set_index("month")

       sale  year
month
1        55  2012
4        40  2014
7        84  2013
10       31  2014

In [42]:
# 设置多个索引
df.set_index(["year", "month"])

            sale
year month
2012 1        55
2014 4        40
2013 7        84
2014 10       31

In [43]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [44]:
df.index.names

FrozenList([None])